a=int(input("幾度?"))
if a<=120:
    round(a,2)
    print("夏月總金額"+a*2.10+"元")
    print("非夏月總金額"+a*2.10+"元")
elif a>120 and a<=330:
    b=120*2.10+(a-120)*3.02
    c=(120*2.10+(a-120)*2.68)
    b=round(b,2)
    c=round(c,2)
    print("夏月總金額"+str(b)+"元")
    print("非夏月總金額"+str(c)+"元")
elif a>330 and a<=500:
    d=120*2.10+(330-120)*3.02+(a-330)*4.39
    e=120*2.10+(330-120)*2.68+(a-330)*3.61
    d=round(d,2)
    e=round(e,2)
    print("夏月總金額"+str(d)+"元")
    print("非夏月總金額"+str(e)+"元")
elif a>500 and a<=700:
    f=120*2.10+(330-120)*3.02+(500-330)*4.39+(a-500)*4.97
    g=120*2.10+(330-120)*2.68+(500-330)*3.61+(a-500)*4.01
    f=round(f,2)
    g=round(g,2)    
    print("夏月總金額"+str(f)+"元")
    print("非夏月總金額"+str(g)+"元")
elif a>700:
    h=120*2.10+(330-120)*3.02+(500-330)*4.39+(700-500)*4.97+(a-700)*5.63
    i=120*2.10+(330-120)*2.68+(500-330)*3.61+(700-500)*4.01+(a-700)*4.50
    h=round(h,2)
    i=round(i,2)
    print("夏月總金額"+str(h)+"元")
    print("非夏月總金額"+str(i)+"元")
    

